ЖБИ_УТ11.РасширениеЖБИ/src/DataProcessors/ЖБИ_ЗагрузкаСвойствНоменклатурыПоставщика/ЖБИ_ЗагрузкаСвойствНоменклатурыПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЖБИ_ЗагрузкаСвойствНоменклатурыПоставщика</name>
</mdclass:DataProcessor>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/ЖБИ_НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НоменклатураПоставщиков</name>
  <comment>ЖБИ - Номенклатура поставщиков</comment>
  <resources>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОсторожно</name>
    <comment>Осторожно</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаОбщепринятая</name>
    <comment>Маркировка общепринятая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенноеНаименование</name>
    <comment>Расширенное наименование</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативныйДокумент</name>
    <comment>Норматив. документ</comment>
    <type>
      <types>CatalogRef.ЖБИ_НормативныеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>НормаАвто</name>
    <comment>Норма погрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Качество</name>
    <comment>Качество</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <comment>Вес, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Объем м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <comment>Длина мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрММ</name>
    <comment>Диаметр мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтверстиеММ</name>
    <comment>Отверстие, мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВх</name>
    <comment>Диаметр вх. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВых</name>
    <comment>Диаметр вых. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочаяДлина</name>
    <comment>Рабочая длин. мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаСтенки</name>
    <comment>Толщина стенки мм.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Глубина</name>
    <comment>Глубина, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМакс</name>
    <comment>Шир. макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМин</name>
    <comment>Шир. мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМакс</name>
    <comment>Высота, макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМин</name>
    <comment>Высота, мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Армирование</name>
    <comment>Армирование</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БетонВ</name>
    <comment>Бетон, В</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВодонепрW</name>
    <comment>Водонепр. W</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МорозF</name>
    <comment>Мороз. F</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертифицированДо</name>
    <comment>Сертифицирован до</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолВУпаковке</name>
    <comment>Кол-во в упаковке, шт</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесАвто</name>
    <comment>Вес в авто, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <comment>Направление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Коментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мощность</name>
    <comment>Производственные мощности, шт./м2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПаузе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <comment>Дата обновления</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ccf79bb-a7d7-4c19-80ad-eb0164f60ec4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖБИ_НаПаузе</name>
    <comment>Поставить поставщика на паузу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаКонтроляЦены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ИндивидуальнаяЦена</name>
    <comment>ЖБИ - ИндивидуальнаяЦена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/НоменклатураПоставщиков/НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_НеИспользуется</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/DataProcessors/ЖБИ_ЗагрузкаСвойствНоменклатурыПоставщика/Forms/Форма/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ 

&НаСервереБезКонтекста
Функция ОбновитьНаименованиеПоставщика(НоменклатураПоставщика,НаименованиеТовраПоставщика, ИнформацияОбОшибки = "")
	
	Результат 				= Истина;
	СпрОбъект 				= НоменклатураПоставщика.ПолучитьОбъект();
	СпрОбъект.Наименование 	= НаименованиеТовраПоставщика;
	Попытка
		СпрОбъект.Записать();
	Исключение
		Результат		   = Ложь;
		ИнформацияОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтборыСпискаПоУмолчанию()
	
	Список.Отбор.Элементы.Очистить();
	//Поставщик
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.Партнеры.ПустаяСсылка();
	ЭлементОтбора.Использование = Ложь;
	
	//Артикул
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Артикул");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = "";
	ЭлементОтбора.Использование = Ложь;
	
	//МаркировкаОбщепринятая
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаркировкаОбщепринятая");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = "";
	ЭлементОтбора.Использование = Ложь;
	
	//Номенклатура
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
	ЭлементОтбора.Использование = Ложь;
	
	//НоменклатураПоставщика
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоменклатураПоставщика");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.НоменклатураПоставщиков.ПустаяСсылка();
	ЭлементОтбора.Использование = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуТоваров()
	
	//Получаем схема компановки данных (здесь хранится текст запроса)
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	//Получаем настройки пользователя (отборы, сортировки и т.п.)
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	//Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТЗРезультат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьНастройкиМакета(ТабличныйДок, ЕстьОтбор)
	
	ТабличныйДок.Очистить();
	Если НЕ ЕстьОтбор Тогда
		Возврат ТабличныйДок;
	КонецЕсли;
		
	ТаблТоваров			= ПолучитьТаблицуТоваров();	
	Макет 				= Обработки.ЖБИ_ЗагрузкаСвойствНоменклатурыПоставщика.ПолучитьМакет("СвойстваНоменклатурыПоставщика");	
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ТабличныйДок.Вывести(ОбластьШапка);
	ОбластьТовар 		= Макет.ПолучитьОбласть("Товар");  
	Для Каждого НомСтр Из ТаблТоваров Цикл 
		ОбластьТовар.Параметры.Поставщик 					= НомСтр.Партнер;
		ОбластьТовар.Параметры.Партнер 						= НомСтр.Партнер;
		ОбластьТовар.Параметры.НоменклатураПоставщика 		= НомСтр.НоменклатураПоставщика;
		ОбластьТовар.Параметры.Артикул 						= НомСтр.НоменклатураПоставщика.Артикул;
		ОбластьТовар.Параметры.МаркировкаОбщепринятая 		= НомСтр.НоменклатураПоставщика.Номенклатура.Артикул;
		ОбластьТовар.Параметры.НормативныйДокумент 			= НомСтр.НормативныйДокумент;
		ОбластьТовар.Параметры.ПунктОтгрузки 				= НомСтр.ПунктОтгрузки;
		ОбластьТовар.Параметры.Автор 						= НомСтр.Автор;
		
		ЗаполнитьЗначенияСвойств(ОбластьТовар.Параметры,НомСтр);		
		ТабличныйДок.Вывести(ОбластьТовар);	
	КонецЦикла;
	
	ТабличныйДок.ФиксацияСверху = 1;
	ТабличныйДок.ФиксацияСлева 	= 1;
	
	Возврат ТабличныйДок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьДанныеНоменклатурыПоставщика(ТаблицаНабораЗаписей, СообщениеОбОшибке)
	
	Отказ = Истина;
	Результат = РегистрыСведений.ЖБИ_НоменклатураПоставщиков.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибке);
	Если Не Результат Тогда
		Отказ = Ложь;	
	КонецЕсли;
	
	Возврат Отказ;
		
КонецФункции

&НаСервереБезКонтекста
Процедура фСформироватьДанныеНаСервере(ТабличныйДок, СообщениеОбОшибке)
		
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	НомерСтрокиЗагрузки	= 2;
	ТаблицаСвойств 		= РегистрыСведений.ЖБИ_НоменклатураПоставщиков.ПолучитьПустуюТаблицуНаборЗаписей();		
	Для НомерСтрокиОбласти = НомерСтрокиЗагрузки По ТабличныйДок.ВысотаТаблицы Цикл

		Партнер = ТабличныйДок.Область(НомерСтрокиОбласти,2).Расшифровка;
		Если ПустаяСтрока(Партнер) Тогда
			СообщениеОбОшибке = "Не удалось сопоставить Поставщика";
			Прервать;
		КонецЕсли;
		
		НоменклатураПоставщика = ТабличныйДок.Область(НомерСтрокиОбласти,4).Расшифровка;
		Если ПустаяСтрока(НоменклатураПоставщика) Тогда
			СообщениеОбОшибке = "Не удалось сопоставить Номенклатуру поставщика";
			Прервать;
		КонецЕсли;
		
		НормативныйДокумент = ТабличныйДок.Область(НомерСтрокиОбласти,6).Расшифровка;
		Если ПустаяСтрока(НормативныйДокумент) Тогда
			СообщениеОбОшибке = "Не удалось сопоставить Нормативный документ";
			Прервать;
		КонецЕсли;
		
		ПунктОтгрузки = ТабличныйДок.Область(НомерСтрокиОбласти,7).Расшифровка;
		Если ПустаяСтрока(НормативныйДокумент) Тогда
			СообщениеОбОшибке = "Не удалось сопоставить Пункут отгрузки";
			Прервать;
		КонецЕсли;
		
		Автор = ТабличныйДок.Область(НомерСтрокиОбласти,8).Расшифровка;
		Если ПустаяСтрока(Автор) Тогда
			СообщениеОбОшибке = "Не удалось сопоставить Автора";
			Прервать;
		КонецЕсли;
		 		
		НоваяСтр 										= ТаблицаСвойств.Добавить();				
		НоваяСтр.Партнер								= Партнер; 
		
		НаименованиеТовраПоставщика 					= ТабличныйДок.Область(НомерСтрокиОбласти,5).Текст;
		Если Не ПустаяСтрока(НаименованиеТовраПоставщика) Тогда 
			Результат = ОбновитьНаименованиеПоставщика(НоменклатураПоставщика,НаименованиеТовраПоставщика,СообщениеОбОшибке);
			Если Не Результат Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		НоваяСтр.НоменклатураПоставщика					= НоменклатураПоставщика;	
		НоваяСтр.НормативныйДокумент					= НормативныйДокумент;
		НоваяСтр.ПунктОтгрузки							= ПунктОтгрузки;
		НоваяСтр.Автор									= Автор;

		НоваяСтр.ДатаОбновления 						= ТабличныйДок.Область(НомерСтрокиОбласти,2).Текст;
		НоваяСтр.СтатусОсторожно 						= ТабличныйДок.Область(НомерСтрокиОбласти,3).Текст;		
		НоваяСтр.МаркировкаОбщепринятая 				= ТабличныйДок.Область(НомерСтрокиОбласти,6).Текст;		
		НоваяСтр.НормаАвто 								= ТабличныйДок.Область(НомерСтрокиОбласти,7).Текст;
		НоваяСтр.Качество 								= ТабличныйДок.Область(НомерСтрокиОбласти,8).Текст;
		НоваяСтр.Вес 									= ТабличныйДок.Область(НомерСтрокиОбласти,9).Текст;
		НоваяСтр.Объем 									= ТабличныйДок.Область(НомерСтрокиОбласти,10).Текст;
		НоваяСтр.Мощность 								= ТабличныйДок.Область(НомерСтрокиОбласти,11).Текст;
		//НоваяСтр.ДиаметрММ 								= ТабличныйДок.Область(НомерСтрокиОбласти,10).Текст;
		//НоваяСтр.ДиаметрВх 								= ТабличныйДок.Область(НомерСтрокиОбласти,11).Текст;
		//НоваяСтр.ДиаметрВых 							= ТабличныйДок.Область(НомерСтрокиОбласти,12).Текст;
		//НоваяСтр.РабочаяДлина 							= ТабличныйДок.Область(НомерСтрокиОбласти,13).Текст;
		//НоваяСтр.ТолщинаСтенки 							= ТабличныйДок.Область(НомерСтрокиОбласти,14).Текст;
		//НоваяСтр.Глубина 								= ТабличныйДок.Область(НомерСтрокиОбласти,15).Текст;
		//НоваяСтр.ШиринаМакс 							= ТабличныйДок.Область(НомерСтрокиОбласти,16).Текст;
		//НоваяСтр.ШиринаМин 								= ТабличныйДок.Область(НомерСтрокиОбласти,17).Текст;
		//НоваяСтр.ВысотаМакс 							= ТабличныйДок.Область(НомерСтрокиОбласти,18).Текст;
		//НоваяСтр.ВысотаМин 								= ТабличныйДок.Область(НомерСтрокиОбласти,19).Текст;
		//НоваяСтр.Армирование 							= ТабличныйДок.Область(НомерСтрокиОбласти,20).Текст;
		//НоваяСтр.БетонВ 								= ТабличныйДок.Область(НомерСтрокиОбласти,21).Текст;
		//НоваяСтр.ВодонепрW 								= ТабличныйДок.Область(НомерСтрокиОбласти,22).Текст;
		//НоваяСтр.МорозF 								= ТабличныйДок.Область(НомерСтрокиОбласти,23).Текст;
		НоваяСтр.СертифицированДо 						= ТабличныйДок.Область(НомерСтрокиОбласти,12).Текст;
		НоваяСтр.Негабаритный 							= ТабличныйДок.Область(НомерСтрокиОбласти,13).Текст;
		НоваяСтр.КолВУпаковке 							= ТабличныйДок.Область(НомерСтрокиОбласти,14).Текст;
		Если ЗначениеЗаполнено(ТабличныйДок.Область(НомерСтрокиОбласти,13).Текст) Тогда 
			НоваяСтр.ВесАвто 							= ТабличныйДок.Область(НомерСтрокиОбласти,15).Текст; 
		Иначе
			НоваяСтр.ВесАвто							= НоваяСтр.Вес * НоваяСтр.НормаАвто;
		КонецЕсли;
		НоваяСтр.Направление 							= ТабличныйДок.Область(НомерСтрокиОбласти,16).Текст;
		НоваяСтр.Комментарий 							= ТабличныйДок.Область(НомерСтрокиОбласти,17).Текст;
	КонецЦикла;
	
	РезультатОбновления = ОбновитьДанныеНоменклатурыПоставщика(ТаблицаСвойств,СообщениеОбОшибке);
	ЗафиксироватьТранзакцию();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	ЕстьОтбор = Ложь;
	Для Каждого НомОтбор Из Список.Отбор.Элементы Цикл
		Если НомОтбор.Использование Тогда
			ЕстьОтбор = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		 
	ЗаполнитьНастройкиМакета(ТабДокумент, ЕстьОтбор); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)	
	СообщениеОбОшибке = "";
	фСформироватьДанныеНаСервере(ТабДокумент, СообщениеОбОшибке);
	Если НЕ ПустаяСтрока(СообщениеОбОшибке) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка свойств выполнена");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОтборыСпискаПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
КонецПроцедуры

#КонецОбласти
